#
# @lc app=leetcode.cn id=263 lang=python3
#
# [263] 丑数
#

# @lc code=start
class Solution:
    def isUgly(self, n: int) -> bool:
        #---------------------------------------------------------------#
        #    简单题：
        #    首先判断丑数条件，仅能被2、3、5整除，且1为丑数
        #    因此把1作为阈值（1可以包含，也可以不包含）
        #    当n>=1时，分别对n进行2、3、5的整除判断
        #    一旦能够被其中一个整除就将其除掉
        #    丑数在经过除完过后就会变成1，非丑数则不为1，例如负数除完是会变成-1
        #    1作为丑数特例本身就是1，是否跳进循环都可以
        #    跳出循环后对n进行再判断，若是1则为丑数，若非1则不为丑数
        #---------------------------------------------------------------#
        while n >= 1:
            if n % 2 == 0:
                n /= 2
            elif n % 3 == 0:
                n /= 3
            elif n % 5 == 0:
                n /= 5
            else:
                break
        if n == 1:
            return True
        else:
            return False
# @lc code=end

